MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK40DX128ZVLQ10/mcu.h
#define USBDCD_CONTROL                (*((volatile uint32_t *)0x40035000))      // USBDCD control and interrupt bit fields
#define USBDCD_CLOCK                  (*((volatile uint32_t *)0x40035004))      // Clock Register
#define USBDCD_STATUS                 (*((volatile uint32_t *)0x40035008))      // Status Register
#define USBDCD_TIMER0                 (*((volatile uint32_t *)0x40035010))      // TIMER0 Register
#define USBDCD_TIMER1                 (*((volatile uint32_t *)0x40035014))      // TIMER1 Register
#define USBDCD_TIMER2                 (*((volatile uint32_t *)0x40035018))      // TIMER2 Register


//*****************************************************************************
//
// CAN (FlexCAN) registers
//
//*****************************************************************************

#define CAN0_MCR                      (*((volatile uint32_t *)0x40024000))      // Module Configuration Register (CAN0_MCR)
#define CAN0_CTRL1                    (*((volatile uint32_t *)0x40024004))      // Control 1 Register (CAN0_CTRL1)
#define CAN0_TIMER                    (*((volatile uint32_t *)0x40024008))      // Free Running Timer (CAN0_TIMER)
#define CAN0_RXMGMASK                 (*((volatile uint32_t *)0x40024010))      // Rx Mailboxes Global Mask Register (CAN0_RXMGMASK)
#define CAN0_RX14MASK                 (*((volatile uint32_t *)0x40024014))      // Rx 14 Mask Register (CAN0_RX14MASK)
#define CAN0_RX15MASK                 (*((volatile uint32_t *)0x40024018))      // Rx 15 Mask Register (CAN0_RX15MASK)
#define CAN0_ECR                      (*((volatile uint32_t *)0x4002401C))      // Error Counter (CAN0_ECR)
#define CAN0_ESR1                     (*((volatile uint32_t *)0x40024020))      // Error and Status 1 Register (CAN0_ESR1)
#define CAN0_IMASK2                   (*((volatile uint32_t *)0x40024024))      // Interrupt Masks 2 Register (CAN0_IMASK2)
#define CAN0_IMASK1                   (*((volatile uint32_t *)0x40024028))      // Interrupt Masks 1 Register (CAN0_IMASK1)
#define CAN0_IFLAG2                   (*((volatile uint32_t *)0x4002402C))      // Interrupt Flags 2 Register (CAN0_IFLAG2)
#define CAN0_IFLAG1                   (*((volatile uint32_t *)0x40024030))      // Interrupt Flags 1 Register (CAN0_IFLAG1)
#define CAN0_CTRL2                    (*((volatile uint32_t *)0x40024034))      // Control 2 Register (CAN0_CTRL2)
#define CAN0_ESR2                     (*((volatile uint32_t *)0x40024038))      // Error and Status 2 Register (CAN0_ESR2)
#define CAN0_CRCR                     (*((volatile uint32_t *)0x40024044))      // CRC Register (CAN0_CRCR)
#define CAN0_RXFGMASK                 (*((volatile uint32_t *)0x40024048))      // Rx FIFO Global Mask Register (CAN0_RXFGMASK)
#define CAN0_RXFIR                    (*((volatile uint32_t *)0x4002404C))      // Rx FIFO Information Register (CAN0_RXFIR)
#define CAN0_RXIMR0                   (*((volatile uint32_t *)0x40024880))      // Rx Individual Mask Registers (CAN0_RXIMR0)
#define CAN0_RXIMR1                   (*((volatile uint32_t *)0x40024884))      // Rx Individual Mask Registers (CAN0_RXIMR1)
#define CAN0_RXIMR2                   (*((volatile uint32_t *)0x40024888))      // Rx Individual Mask Registers (CAN0_RXIMR2)
#define CAN0_RXIMR3                   (*((volatile uint32_t *)0x4002488C))      // Rx Individual Mask Registers (CAN0_RXIMR3)
#define CAN0_RXIMR4                   (*((volatile uint32_t *)0x40024890))      // Rx Individual Mask Registers (CAN0_RXIMR4)
#define CAN0_RXIMR5                   (*((volatile uint32_t *)0x40024894))      // Rx Individual Mask Registers (CAN0_RXIMR5)
#define CAN0_RXIMR6                   (*((volatile uint32_t *)0x40024898))      // Rx Individual Mask Registers (CAN0_RXIMR6)
#define CAN0_RXIMR7                   (*((volatile uint32_t *)0x4002489C))      // Rx Individual Mask Registers (CAN0_RXIMR7)
#define CAN0_RXIMR8                   (*((volatile uint32_t *)0x400248A0))      // Rx Individual Mask Registers (CAN0_RXIMR8)
#define CAN0_RXIMR9                   (*((volatile uint32_t *)0x400248A4))      // Rx Individual Mask Registers (CAN0_RXIMR9)
#define CAN0_RXIMR10                  (*((volatile uint32_t *)0x400248A8))      // Rx Individual Mask Registers (CAN0_RXIMR10)
#define CAN0_RXIMR11                  (*((volatile uint32_t *)0x400248AC))      // Rx Individual Mask Registers (CAN0_RXIMR11)
#define CAN0_RXIMR12                  (*((volatile uint32_t *)0x400248B0))      // Rx Individual Mask Registers (CAN0_RXIMR12)
#define CAN0_RXIMR13                  (*((volatile uint32_t *)0x400248B4))      // Rx Individual Mask Registers (CAN0_RXIMR13)
#define CAN0_RXIMR14                  (*((volatile uint32_t *)0x400248B8))      // Rx Individual Mask Registers (CAN0_RXIMR14)
#define CAN0_RXIMR15                  (*((volatile uint32_t *)0x400248BC))      // Rx Individual Mask Registers (CAN0_RXIMR15)
#define CAN1_MCR                      (*((volatile uint32_t *)0x400A4000))      // Module Configuration Register (CAN1_MCR)
#define CAN1_CTRL1                    (*((volatile uint32_t *)0x400A4004))      // Control 1 Register (CAN1_CTRL1)
#define CAN1_TIMER                    (*((volatile uint32_t *)0x400A4008))      // Free Running Timer (CAN1_TIMER)
#define CAN1_RXMGMASK                 (*((volatile uint32_t *)0x400A4010))      // Rx Mailboxes Global Mask Register (CAN1_RXMGMASK)
#define CAN1_RX14MASK                 (*((volatile uint32_t *)0x400A4014))      // Rx 14 Mask Register (CAN1_RX14MASK)
#define CAN1_RX15MASK                 (*((volatile uint32_t *)0x400A4018))      // Rx 15 Mask Register (CAN1_RX15MASK)
#define CAN1_ECR                      (*((volatile uint32_t *)0x400A401C))      // Error Counter (CAN1_ECR)
#define CAN1_ESR1                     (*((volatile uint32_t *)0x400A4020))      // Error and Status 1 Register (CAN1_ESR1)
#define CAN1_IMASK2                   (*((volatile uint32_t *)0x400A4024))      // Interrupt Masks 2 Register (CAN1_IMASK2)
#define CAN1_IMASK1                   (*((volatile uint32_t *)0x400A4028))      // Interrupt Masks 1 Register (CAN1_IMASK1)
#define CAN1_IFLAG2                   (*((volatile uint32_t *)0x400A402C))      // Interrupt Flags 2 Register (CAN1_IFLAG2)
#define CAN1_IFLAG1                   (*((volatile uint32_t *)0x400A4030))      // Interrupt Flags 1 Register (CAN1_IFLAG1)
#define CAN1_CTRL2                    (*((volatile uint32_t *)0x400A4034))      // Control 2 Register (CAN1_CTRL2)
#define CAN1_ESR2                     (*((volatile uint32_t *)0x400A4038))      // Error and Status 2 Register (CAN1_ESR2)
#define CAN1_CRCR                     (*((volatile uint32_t *)0x400A4044))      // CRC Register (CAN1_CRCR)
#define CAN1_RXFGMASK                 (*((volatile uint32_t *)0x400A4048))      // Rx FIFO Global Mask Register (CAN1_RXFGMASK)
#define CAN1_RXFIR                    (*((volatile uint32_t *)0x400A404C))      // Rx FIFO Information Register (CAN1_RXFIR)
#define CAN1_RXIMR0                   (*((volatile uint32_t *)0x400A4880))      // Rx Individual Mask Registers (CAN1_RXIMR0)
#define CAN1_RXIMR1                   (*((volatile uint32_t *)0x400A4884))      // Rx Individual Mask Registers (CAN1_RXIMR1)
#define CAN1_RXIMR2                   (*((volatile uint32_t *)0x400A4888))      // Rx Individual Mask Registers (CAN1_RXIMR2)
#define CAN1_RXIMR3                   (*((volatile uint32_t *)0x400A488C))      // Rx Individual Mask Registers (CAN1_RXIMR3)
#define CAN1_RXIMR4                   (*((volatile uint32_t *)0x400A4890))      // Rx Individual Mask Registers (CAN1_RXIMR4)
#define CAN1_RXIMR5                   (*((volatile uint32_t *)0x400A4894))      // Rx Individual Mask Registers (CAN1_RXIMR5)
#define CAN1_RXIMR6                   (*((volatile uint32_t *)0x400A4898))      // Rx Individual Mask Registers (CAN1_RXIMR6)
#define CAN1_RXIMR7                   (*((volatile uint32_t *)0x400A489C))      // Rx Individual Mask Registers (CAN1_RXIMR7)
#define CAN1_RXIMR8                   (*((volatile uint32_t *)0x400A48A0))      // Rx Individual Mask Registers (CAN1_RXIMR8)
#define CAN1_RXIMR9                   (*((volatile uint32_t *)0x400A48A4))      // Rx Individual Mask Registers (CAN1_RXIMR9)
#define CAN1_RXIMR10                  (*((volatile uint32_t *)0x400A48A8))      // Rx Individual Mask Registers (CAN1_RXIMR10)
#define CAN1_RXIMR11                  (*((volatile uint32_t *)0x400A48AC))      // Rx Individual Mask Registers (CAN1_RXIMR11)
#define CAN1_RXIMR12                  (*((volatile uint32_t *)0x400A48B0))      // Rx Individual Mask Registers (CAN1_RXIMR12)
#define CAN1_RXIMR13                  (*((volatile uint32_t *)0x400A48B4))      // Rx Individual Mask Registers (CAN1_RXIMR13)
#define CAN1_RXIMR14                  (*((volatile uint32_t *)0x400A48B8))      // Rx Individual Mask Registers (CAN1_RXIMR14)
#define CAN1_RXIMR15                  (*((volatile uint32_t *)0x400A48BC))      // Rx Individual Mask Registers (CAN1_RXIMR15)


//*****************************************************************************
//
// SPI (DSPI) registers
//
//*****************************************************************************

#define SPI0_MCR                      (*((volatile uint32_t *)0x4002C000))      // DSPI Module Configuration Register (SPI0_MCR)
#define SPI0_TCR                      (*((volatile uint32_t *)0x4002C008))      // DSPI Transfer Count Register (SPI0_TCR)
#define SPI0_CTAR0                    (*((volatile uint32_t *)0x4002C00C))      // DSPI Clock and Transfer Attributes Register (In Master Mode) (SPI0_CTAR0)
#define SPI0_CTAR0_SLAVE              (*((volatile uint32_t *)0x4002C00C))      // DSPI Clock and Transfer Attributes Register (In Slave Mode) (SPI0_CTAR0_SLAVE)
#define SPI0_CTAR1                    (*((volatile uint32_t *)0x4002C010))      // DSPI Clock and Transfer Attributes Register (In Master Mode) (SPI0_CTAR1)
#define SPI0_SR                       (*((volatile uint32_t *)0x4002C02C))      // DSPI Status Register (SPI0_SR)
#define SPI0_RSER                     (*((volatile uint32_t *)0x4002C030))      // DSPI DMA/Interrupt Request Select and Enable Register (SPI0_RSER)
#define SPI0_PUSHR                    (*((volatile uint32_t *)0x4002C034))      // DSPI PUSH TX FIFO Register In Master Mode (SPI0_PUSHR)
#define SPI0_PUSHR_SLAVE              (*((volatile uint32_t *)0x4002C034))      // DSPI PUSH TX FIFO Register In Slave Mode (SPI0_PUSHR_SLAVE)
#define SPI0_POPR                     (*((volatile uint32_t *)0x4002C038))      // DSPI POP RX FIFO Register (SPI0_POPR)
#define SPI0_TXFR0                    (*((volatile uint32_t *)0x4002C03C))      // DSPI Transmit FIFO Registers (SPI0_TXFR0)
#define SPI0_TXFR1                    (*((volatile uint32_t *)0x4002C040))      // DSPI Transmit FIFO Registers (SPI0_TXFR1)
#define SPI0_TXFR2                    (*((volatile uint32_t *)0x4002C044))      // DSPI Transmit FIFO Registers (SPI0_TXFR2)
#define SPI0_TXFR3                    (*((volatile uint32_t *)0x4002C048))      // DSPI Transmit FIFO Registers (SPI0_TXFR3)
#define SPI0_RXFR0                    (*((volatile uint32_t *)0x4002C07C))      // DSPI Receive FIFO Registers (SPI0_RXFR0)
#define SPI0_RXFR1                    (*((volatile uint32_t *)0x4002C080))      // DSPI Receive FIFO Registers (SPI0_RXFR1)
#define SPI0_RXFR2                    (*((volatile uint32_t *)0x4002C084))      // DSPI Receive FIFO Registers (SPI0_RXFR2)
#define SPI0_RXFR3                    (*((volatile uint32_t *)0x4002C088))      // DSPI Receive FIFO Registers (SPI0_RXFR3)
#define SPI1_MCR                      (*((volatile uint32_t *)0x4002D000))      // DSPI Module Configuration Register (SPI1_MCR)
#define SPI1_TCR                      (*((volatile uint32_t *)0x4002D008))      // DSPI Transfer Count Register (SPI1_TCR)
#define SPI1_CTAR0                    (*((volatile uint32_t *)0x4002D00C))      // DSPI Clock and Transfer Attributes Register (In Master Mode) (SPI1_CTAR0)
#define SPI1_CTAR0_SLAVE              (*((volatile uint32_t *)0x4002D00C))      // DSPI Clock and Transfer Attributes Register (In Slave Mode) (SPI1_CTAR0_SLAVE)
#define SPI1_CTAR1                    (*((volatile uint32_t *)0x4002D010))      // DSPI Clock and Transfer Attributes Register (In Master Mode) (SPI1_CTAR1)
#define SPI1_SR                       (*((volatile uint32_t *)0x4002D02C))      // DSPI Status Register (SPI1_SR)
#define SPI1_RSER                     (*((volatile uint32_t *)0x4002D030))      // DSPI DMA/Interrupt Request Select and Enable Register (SPI1_RSER)
#define SPI1_PUSHR                    (*((volatile uint32_t *)0x4002D034))      // DSPI PUSH TX FIFO Register In Master Mode (SPI1_PUSHR)
#define SPI1_PUSHR_SLAVE              (*((volatile uint32_t *)0x4002D034))      // DSPI PUSH TX FIFO Register In Slave Mode (SPI1_PUSHR_SLAVE)
#define SPI1_POPR                     (*((volatile uint32_t *)0x4002D038))      // DSPI POP RX FIFO Register (SPI1_POPR)
#define SPI1_TXFR0                    (*((volatile uint32_t *)0x4002D03C))      // DSPI Transmit FIFO Registers (SPI1_TXFR0)
#define SPI1_TXFR1                    (*((volatile uint32_t *)0x4002D040))      // DSPI Transmit FIFO Registers (SPI1_TXFR1)
#define SPI1_TXFR2                    (*((volatile uint32_t *)0x4002D044))      // DSPI Transmit FIFO Registers (SPI1_TXFR2)
#define SPI1_TXFR3                    (*((volatile uint32_t *)0x4002D048))      // DSPI Transmit FIFO Registers (SPI1_TXFR3)
#define SPI1_RXFR0                    (*((volatile uint32_t *)0x4002D07C))      // DSPI Receive FIFO Registers (SPI1_RXFR0)
#define SPI1_RXFR1                    (*((volatile uint32_t *)0x4002D080))      // DSPI Receive FIFO Registers (SPI1_RXFR1)
#define SPI1_RXFR2                    (*((volatile uint32_t *)0x4002D084))      // DSPI Receive FIFO Registers (SPI1_RXFR2)
#define SPI1_RXFR3                    (*((volatile uint32_t *)0x4002D088))      // DSPI Receive FIFO Registers (SPI1_RXFR3)
#define SPI2_MCR                      (*((volatile uint32_t *)0x400AC000))      // DSPI Module Configuration Register (SPI2_MCR)
#define SPI2_TCR                      (*((volatile uint32_t *)0x400AC008))      // DSPI Transfer Count Register (SPI2_TCR)
#define SPI2_CTAR0                    (*((volatile uint32_t *)0x400AC00C))      // DSPI Clock and Transfer Attributes Register (In Master Mode) (SPI2_CTAR0)
#define SPI2_CTAR0_SLAVE              (*((volatile uint32_t *)0x400AC00C))      // DSPI Clock and Transfer Attributes Register (In Slave Mode) (SPI2_CTAR0_SLAVE)
#define SPI2_CTAR1                    (*((volatile uint32_t *)0x400AC010))      // DSPI Clock and Transfer Attributes Register (In Master Mode) (SPI2_CTAR1)
#define SPI2_SR                       (*((volatile uint32_t *)0x400AC02C))      // DSPI Status Register (SPI2_SR)
#define SPI2_RSER                     (*((volatile uint32_t *)0x400AC030))      // DSPI DMA/Interrupt Request Select and Enable Register (SPI2_RSER)
#define SPI2_PUSHR                    (*((volatile uint32_t *)0x400AC034))      // DSPI PUSH TX FIFO Register In Master Mode (SPI2_PUSHR)
#define SPI2_PUSHR_SLAVE              (*((volatile uint32_t *)0x400AC034))      // DSPI PUSH TX FIFO Register In Slave Mode (SPI2_PUSHR_SLAVE)
#define SPI2_POPR                     (*((volatile uint32_t *)0x400AC038))      // DSPI POP RX FIFO Register (SPI2_POPR)
#define SPI2_TXFR0                    (*((volatile uint32_t *)0x400AC03C))      // DSPI Transmit FIFO Registers (SPI2_TXFR0)
#define SPI2_TXFR1                    (*((volatile uint32_t *)0x400AC040))      // DSPI Transmit FIFO Registers (SPI2_TXFR1)
#define SPI2_TXFR2                    (*((volatile uint32_t *)0x400AC044))      // DSPI Transmit FIFO Registers (SPI2_TXFR2)
#define SPI2_TXFR3                    (*((volatile uint32_t *)0x400AC048))      // DSPI Transmit FIFO Registers (SPI2_TXFR3)
#define SPI2_RXFR0                    (*((volatile uint32_t *)0x400AC07C))      // DSPI Receive FIFO Registers (SPI2_RXFR0)
#define SPI2_RXFR1                    (*((volatile uint32_t *)0x400AC080))      // DSPI Receive FIFO Registers (SPI2_RXFR1)
#define SPI2_RXFR2                    (*((volatile uint32_t *)0x400AC084))      // DSPI Receive FIFO Registers (SPI2_RXFR2)
#define SPI2_RXFR3                    (*((volatile uint32_t *)0x400AC088))      // DSPI Receive FIFO Registers (SPI2_RXFR3)


//*****************************************************************************
//
// Inter-Integrated Circuit (I2C) registers
//
//*****************************************************************************

#define I2C0_A1                       (*((volatile uint32_t *)0x40066000))      // I2C Address Register 1 (I2C0_A1)
#define I2C0_F                        (*((volatile uint32_t *)0x40066001))      // I2C Frequency Divider register (I2C0_F)
#define I2C0_C1                       (*((volatile uint32_t *)0x40066002))      // I2C Control Register 1 (I2C0_C1)
#define I2C0_S                        (*((volatile uint32_t *)0x40066003))      // I2C Status Register (I2C0_S)
#define I2C0_D                        (*((volatile uint32_t *)0x40066004))      // I2C Data I/O register (I2C0_D)
#define I2C0_C2                       (*((volatile uint32_t *)0x40066005))      // I2C Control Register 2 (I2C0_C2)
#define I2C0_FLT                      (*((volatile uint32_t *)0x40066006))      // I2C Programmable Input Glitch Filter register (I2C0_FLT)
#define I2C0_RA                       (*((volatile uint32_t *)0x40066007))      // I2C Range Address register (I2C0_RA)
#define I2C0_SMB                      (*((volatile uint32_t *)0x40066008))      // I2C SMBus Control and Status register (I2C0_SMB)
#define I2C0_A2                       (*((volatile uint32_t *)0x40066009))      // I2C Address Register 2 (I2C0_A2)
#define I2C0_SLTH                     (*((volatile uint32_t *)0x4006600A))      // I2C SCL Low Timeout Register High (I2C0_SLTH)
#define I2C0_SLTL                     (*((volatile uint32_t *)0x4006600B))      // I2C SCL Low Timeout Register Low (I2C0_SLTL)
#define I2C1_A1                       (*((volatile uint32_t *)0x40067000))      // I2C Address Register 1 (I2C1_A1)
#define I2C1_F                        (*((volatile uint32_t *)0x40067001))      // I2C Frequency Divider register (I2C1_F)
#define I2C1_C1                       (*((volatile uint32_t *)0x40067002))      // I2C Control Register 1 (I2C1_C1)
#define I2C1_S                        (*((volatile uint32_t *)0x40067003))      // I2C Status Register (I2C1_S)
#define I2C1_D                        (*((volatile uint32_t *)0x40067004))      // I2C Data I/O register (I2C1_D)
#define I2C1_C2                       (*((volatile uint32_t *)0x40067005))      // I2C Control Register 2 (I2C1_C2)
#define I2C1_FLT                      (*((volatile uint32_t *)0x40067006))      // I2C Programmable Input Glitch Filter register (I2C1_FLT)
#define I2C1_RA                       (*((volatile uint32_t *)0x40067007))      // I2C Range Address register (I2C1_RA)
#define I2C1_SMB                      (*((volatile uint32_t *)0x40067008))      // I2C SMBus Control and Status register (I2C1_SMB)
#define I2C1_A2                       (*((volatile uint32_t *)0x40067009))      // I2C Address Register 2 (I2C1_A2)
#define I2C1_SLTH                     (*((volatile uint32_t *)0x4006700A))      // I2C SCL Low Timeout Register High (I2C1_SLTH)
#define I2C1_SLTL                     (*((volatile uint32_t *)0x4006700B))      // I2C SCL Low Timeout Register Low (I2C1_SLTL)


//*****************************************************************************
//
// Universal Asynchronous Receiver/Transmitter (UART) registers
//
//*****************************************************************************

