MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK40DX128ZVLQ10/mcu.h
#define Reserved                      0x380000000      // This read-only field is reserved and always has the value zero.
#define Reserved                      0x1F0000000      // This read-only field is reserved and always has the value zero.
#define WRWML                         0x7F800000      // Write Watermark Level
#define Reserved                      0x00038000      // This read-only field is reserved and always has the value zero.
#define Reserved                      0x0001F000      // This read-only field is reserved and always has the value zero.
#define RDWML                         0x00007F80      // Read Watermark Level


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_FEVT register.
//
//*****************************************************************************

#define Reserved                      0x380000000      // This read-only field is reserved and always has the value zero.
#define CINT                          0x10000000      // Force Event Card Interrupt
#define Reserved                      0x38000000      // This read-only field is reserved and always has the value zero.
#define DMAE                          0x01000000      // Force Event DMA Error
#define Reserved                      0x00800000      // This read-only field is reserved and always has the value zero.
#define AC12E                         0x00400000      // Force Event Auto Command 12 Error
#define Reserved                      0x00200000      // This read-only field is reserved and always has the value zero.
#define DEBE                          0x00100000      // Force Event Data End Bit Error
#define DCE                           0x00080000      // Force Event Data CRC Error
#define DTOE                          0x00040000      // Force Event Data Time Out Error
#define CIE                           0x00020000      // Force Event Command Index Error
#define CEBE                          0x00010000      // Force Event Command End Bit Error
#define CCE                           0x00008000      // Force Event Command CRC Error
#define CTOE                          0x00004000      // Force Event Command Time Out Error
#define Reserved                      0x0007E000      // This read-only field is reserved and always has the value zero.
#define CNIBAC12E                     0x00000080      // Force Event Command Not Executed By Auto Command 12 Error
#define Reserved                      0x000000C0      // This read-only field is reserved and always has the value zero.
#define AC12IE                        0x00000010      // Force Event Auto Command 12 Index Error
#define AC12EBE                       0x00000008      // Force Event Auto Command 12 End Bit Error
#define AC12CE                        0x00000004      // Force Event Auto Command 12 CRC Error
#define AC12TOE                       0x00000002      // Force Event Auto Command 12 Time Out Error
#define AC12NE                        0x00000001      // Force Event Auto Command 12 Not Executed
#define CINT                          0x80000000      // Force Event Card Interrupt


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_ADMAES register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFFF80000000      // This read-only field is reserved and always has the value zero.
#define ADMADCE                       0x00000008      // ADMA Descritor Error
#define ADMALME                       0x00000004      // ADMA Length Mismatch Error
#define ADMAES                        0x00000006      // ADMA Error State (when ADMA Error is occurred.)


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_ADSADDR register.
//
//*****************************************************************************

#define ADSADDR                       0x1FFFFFFF80000000      // ADMA System Address
#define Reserved                      0x00000006      // This read-only field is reserved and always has the value zero.


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_VENDOR register.
//
//*****************************************************************************

#define Reserved                      0x780000000      // This read-only field is reserved and always has the
#define EXBLKNU                       0x00000002      // Exact block number block read enable for SDIO CMD53
#define EXTDMAEN                      0x00000001      // External DMA Request Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_MMCBOOT register.
//
//*****************************************************************************

#define BOOTBLKCNT                    0x7FFF80000000      // The value defines the stop at block gap value of automatic mode. When received card                block cnt is equal to BOOTBLKCNT and AUTOSABGEN is 1, then stop at block gap.
#define AUTOSABGEN                    0x00000080      // When boot, enable auto stop at block gap   function. This function will      be  triggered,   and  host will stop at block gap when received card block cnt is  equal to BOOTBLKCNT.
#define BOOTEN                        0x00000040      // Boot mode enable
#define BOOTMODE                      0x00000020      // Boot mode select
#define BOOTACK                       0x00000010      // Boot ack mode select
#define DTOCVACK                      0x00000078      // Boot ACK time out counter value.


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_HOSTVER register.
//
//*****************************************************************************

