MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK40DX128ZVLQ10/mcu.h
#define VVN                           0x007F8000      // Vendor Version Number
#define SVN                           0x00007F80      // Specification Version Number


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_GCR register.
//
//*****************************************************************************

#define RVEN                          0x80000000      // Regulated voltage enable
#define RVTRIM                        0x78000000      // Regulated voltage trim
#define CPSEL                         0x00800000      // Charge pump or resistor bias select
#define HREFSEL                       0x00400000      // High reference select
#define LADJ                          0x00600000      // Load adjust
#define VSUPPLY                       0x00060000      // Voltage supply control
#define LCDIEN                        0x00008000      // LCD frame frequency interrupt enable
#define FDCIEN                        0x00004000      // LCD fault detection complete interrupt enable
#define ALTDIV                        0x00006000      // LCD alternate clock divider
#define LCDWAIT                       0x00000200      // LCD driver, charge pump, resistor bias network, and voltage regulator stop while in Wait mode.
#define LCDSTP                        0x00000100      // LCD driver, charge pump, resistor bias network, and voltage regulator while in Stop mode.
#define LCDEN                         0x00000080      // LCD driver enable
#define SOURCE                        0x00000040      // LCD clock source select
#define LCLK                          0x000000E0      // LCD clock prescaler
#define DUTY                          0x0000001C      // LCD duty select


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_AR register.
//
//*****************************************************************************

#define LCDIF                         0x00008000      // LCD frame frequency interrupt flag
#define BLINK                         0x00000080      // Blink command
#define ALT                           0x00000040      // Alternate display mode
#define BLANK                         0x00000020      // Blank display mode
#define BMODE                         0x00000008      // Blink mode
#define BRATE                         0x0000001C      // Blink-rate configuration


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_FDCR register.
//
//*****************************************************************************

#define FDPRS                         0x0001C000      // Fault detect clock prescaler
#define FDSWW                         0x00003800      // Fault detect sample window width
#define FDEN                          0x00000100      // Fault detect enable
#define FDBPEN                        0x00000040      // Fault detect backplane enable
#define FDPINID                       0x000007E0      // Fault detect pin ID


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_FDSR register.
//
//*****************************************************************************

#define FDCF                          0x00008000      // Fault detection complete flag
#define FDCNT                         0x00007F80      // Fault detect counter


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_PENn register.
//
//*****************************************************************************

#define PEN                           0x7FFFFFFF80000000      // LCD pin enable


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_BPENn register.
//
//*****************************************************************************

#define BPEN                          0x7FFFFFFF80000000      // Backplane enable


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF3TO0 register.
//
//*****************************************************************************

#define WF3                           0x7F80000000      // Segment-on frontplane operation — Each bit turns on or off the segments associated with LCD_P3 in the following pattern: HGFEDCBA (most-significant bit controls segment H and least significant bit controls segment A). Segment-on backplane operation — Each bit activates or deactivates the phases associated with LCD_P3 in the following pattern: HGFEDCBA (most-significant bit controls phase H and least significant bit controls phase A)
#define WF2                           0x7F800000      // Controls segments or phases connected to LCD_P2 as described above for WF3
#define WF1                           0x007F8000      // Controls segments or phases connected to LCD_P1 as described above for WF3
#define WF0                           0x00007F80      // Controls segments or phases connected to LCD_P0 as described above for WF3


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF35TO32 register.
//
//*****************************************************************************

#define WF35                          0x7F80000000      // Controls segments or phases connected to LCD_P35 as described above for WF3TO0[WF3]
#define WF34                          0x7F800000      // Controls segments or phases connected to LCD_P34 as described above for WF3TO0[WF3]
#define WF33                          0x007F8000      // Controls segments or phases connected to LCD_P33 as described above for WF3TO0[WF3]
#define WF32                          0x00007F80      // Controls segments or phases connected to LCD_P32 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF39TO36 register.
//
//*****************************************************************************

#define WF39                          0x7F80000000      // Controls segments or phases connected to LCD_P39 as described above for WF3TO0[WF3]
#define WF38                          0x7F800000      // Controls segments or phases connected to LCD_P38 as described above for WF3TO0[WF3]
#define WF37                          0x007F8000      // Controls segments or phases connected to LCD_P37 as described above for WF3TO0[WF3]
#define WF36                          0x00007F80      // Controls segments or phases connected to LCD_P36 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF43TO40 register.
//
//*****************************************************************************

#define WF43                          0x7F80000000      // Controls segments or phases connected to LCD_P43 as described above for WF3TO0[WF3]
#define WF42                          0x7F800000      // Controls segments or phases connected to LCD_P42 as described above for WF3TO0[WF3]
#define WF41                          0x007F8000      // Controls segments or phases connected to LCD_P41 as described above for WF3TO0[WF3]
#define WF40                          0x00007F80      // Controls segments or phases connected to LCD_P40 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF47TO44 register.
//
//*****************************************************************************

#define WF47                          0x7F80000000      // Controls segments or phases connected to LCD_P47 as described above for WF3TO0[WF3]
#define WF46                          0x7F800000      // Controls segments or phases connected to LCD_P46 as described above for WF3TO0[WF3]
#define WF45                          0x007F8000      // Controls segments or phases connected to LCD_P45 as described above for WF3TO0[WF3]
#define WF44                          0x00007F80      // Controls segments or phases connected to LCD_P44 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF51TO48 register.
//
//*****************************************************************************

#define WF51                          0x7F80000000      // Controls segments or phases connected to LCD_P51 as described above for WF3TO0[WF3]
#define WF50                          0x7F800000      // Controls segments or phases connected to LCD_P50 as described above for WF3TO0[WF3]
#define WF49                          0x007F8000      // Controls segments or phases connected to LCD_P49 as described above for WF3TO0[WF3]
#define WF48                          0x00007F80      // Controls segments or phases connected to LCD_P48 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF55TO52 register.
//
//*****************************************************************************

#define WF55                          0x7F80000000      // Controls segments or phases connected to LCD_P55 as described above for WF3TO0[WF3]
#define WF54                          0x7F800000      // Controls segments or phases connected to LCD_P54 as described above for WF3TO0[WF3]
#define WF53                          0x007F8000      // Controls segments or phases connected to LCD_P53 as described above for WF3TO0[WF3]
#define WF52                          0x00007F80      // Controls segments or phases connected to LCD_P52 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF59TO56 register.
//
//*****************************************************************************

#define WF59                          0x7F80000000      // Controls segments or phases connected to LCD_P59 as described above for WF3TO0[WF3]
#define WF58                          0x7F800000      // Controls segments or phases connected to LCD_P58 as described above for WF3TO0[WF3]
#define WF57                          0x007F8000      // Controls segments or phases connected to LCD_P57 as described above for WF3TO0[WF3]
#define WF56                          0x00007F80      // Controls segments or phases connected to LCD_P56 as described above for WF3TO0[WF3]


//*****************************************************************************
//
// The following are defines for the bit fields in the LCD_WF63TO60 register.
//
//*****************************************************************************

#define WF63                          0x7F80000000      // Controls segments or phases connected to LCD_P63 as described above for WF3TO0[WF3]
#define WF62                          0x7F800000      // Controls segments or phases connected to LCD_P62 as described above for WF3TO0[WF3]
#define WF61                          0x007F8000      // Controls segments or phases connected to LCD_P61 as described above for WF3TO0[WF3]
#define WF60                          0x00007F80      // Controls segments or phases connected to LCD_P60 as described above for WF3TO0[WF3]



#endif // __MK40DX128ZVLQ10_H__

